{
    "title": "拨开量子计算的云雾",
    "userNickname": "尹璋琦",
    "userDescription": "物理学 话题的优秀回答者",
    "userImageUrl": "https://pic1.zhimg.com/v2-bf429a939cce09d19ab6e70b3f29667c_is.jpg",
    "answerStar": 673,
    "commentNumber": 35,
    "answerExtraction": " 系统上线一天的感言: 清华大学的量子云服务测试开放一天多了，目前有一百六十多个用户，提交了近一百个任务。用户使用我们的服务时，偶尔会出现保真度特别低的结果，我们知道这是系统软件的bug，正在努力的解决中。bug的存在某种程度上也向用户暗示，他们提交的任务确实是运行在真实的量子计算机上的，而不是在模拟器上。我们开发这个",
    "answerLength": 2206,
    "globalKeyword": [
        "量子",
        "服务",
        "计算机",
        "研究",
        "姚班"
    ],
    "answerDescription": "<p>\n 系统上线一天的感言:  清华大学的量子云服务测试开放一天多了，目前有一百六十多个用户，提交了近一百个任务。用户使用我们的服务时，偶尔会出现保真度特别低的结果，我们知道这是系统软件的bug，正在努力的解决中。bug的存在某种程度上也向用户暗示，他们提交的任务确实是运行在真实的量子计算机上的，而不是在模拟器上。我们开发这个服务的目的之一，就是希望有更多人来帮助我们测试系统，报告bug给我们，帮助我们提升系统，大家共同促进中国的量子计算研究。\n</p>\n<p class='ztext-empty-paragraph'>\n <br/>\n</p>\n<p>\n 作为清华大学交叉信息研究院的老师，我带过好几位本院姚班本科生做科研训练。不过尴尬的是，我是纯粹的物理学背景，而学生们大都是信息学背景。他们之所以找我，是想研究量子信息与量子计算。为他们设计合适的研究课题对我来说并不容易。实用的量子计算机还未出现，学生们研究量子计算，只能从比较抽象的数学理论出发，而这并非我所长。我习惯于针对具体的实验系统来做理论，需要长时间的积累和比较好的物理基础，这又非计算机专业本科生所长。\n</p>\n<p>\n 正在跟我做研究的姚班大四学生黄施霖，是一年半以前加入的。他选择研究量子信息的起因是他不想走寻常路，要挑战量子信息与量子计算。可是黄同学的高中物理基础一般般，必须要把物理补一下才能做量子信息。他在我组里参加了半年多组会，学习了院里的量子信息课程，做了点初步的研究之后，今年春季我推荐他去加拿大滑铁卢大学的Institute for Quantum Computing（IQC），跟着曾蓓老师做了一个学期的科研。在加拿大，黄同学表现出深厚的数学基础和敏锐的触觉，做了好几个漂亮的工作。尤其是学会了与实验合作，对基于核磁共振的量子计算系统有了初步的了解。\n</p>\n<p>\n 今年暑假，曾蓓教授来清华大学高研院访问。八月的一天，她召集组里的学生博后，并找到了我同事孙麓岩教授，来访问的电子科大王晓霆教授，以及我来交流讨论IBM新上线的量子计算云服务。曾蓓的学生陆思锐（基科班大三）用投影仪展示了这个服务的细节，我们觉得很不错。对我来说，这个服务解决了我指导本科生做科研的一个大问题。所以我马上叫我组里的姚班学生去学习这个服务的用法，并通过曾蓓的推荐，拿到了邀请码，获得了登录权限。\n</p>\n<p>\n 我们同时也有非常强的紧迫感：美国的量子计算都已经走到了实用化的边缘了，这个云服务平台就是证明，如果我们自己不行动起来，差距会越来越大。我们注意到，量子计算的研究其实是分层级的。最底层的是物理层，研究如何设计量子计算的芯片电路，量子比特所承载的材料等等。在这之上是量子控制层，涉及到对量子计算芯片的最优化控制与读出等。量子控制层之上是量子电路层，这一层包含我们做量子计算理论模型分析经常要用的的量子逻辑门序列等。在量子电路层之上才是量子算法层面。再往上，才涉及到量子纠错的逻辑量子比特，量子容错计算，以及量子程序等等。\n</p>\n<p>\n IBM的量子云服务，开放的是量子计算中的量子电路层和量子算法层。用户可以根据所要运行的算法，设计好电路，并转换为程序语言发送给云端，由计算机转换为相应的量子控制脉冲信号，操控量子计算机运作，最终得到计算结果，然后返回给用户。对于用户来说，利用这个云服务，可以学习量子计算的基本理论与方法，对未来的量子计算机有一个直观的感受。这个服务的界面对信息学背景的人是非常友好的。他们学会了量子计算的算法规则后，可以自己编程，控制云端服务器完成相应的计算任务。但是对于想要自己造量子计算机的研究人员来说，这个服务就远远不够了。我们还关心量子控制层，针对物理层如何优化控制脉冲，提升量子逻辑门的保真度等等。\n</p>\n<p>\n 有人说，那我们就做一个自己的量子云服务吧！这个提议获得了大家一致的认可。我们在量子计算的理论与实验上积累很长时间，大家的背景各不相同：有的擅长量子计算的纠错与容错理论分析，有的擅长量子计算的物理实现理论，有的擅长量子计算的控制脉冲优化与计算，还有的擅长计算机编程。有这么多经验丰富的教授、博士后、博士生以及基科班与姚班本科生，就缺一台量子计算机了！\n</p>\n<p>\n 参加讨论的物理系博士生辛涛和李可仁提出，他们的导师龙桂鲁教授早就想做量子云，恰好龙老师是曾蓓的本科科研训练指导老师，于是正好合作。龙桂鲁教授2000年开始指导曾蓓做本科科研，早在那时，他们就开始了基于核磁共振量子计算的实验研究。目前已经有成熟和稳定的量子计算研究平台，基于此平台完成了不少漂亮的实验工作。然后曾蓓又找来她的博士后李俊、前博士后鲁大为（现为南方科大助理教授）和IQC以及北京计算科学研究中心的罗志煌博士，均为核磁共振量子计算专家。李俊和鲁大为实际组织和指导了本项目的许多技术细节。\n</p>\n<p>\n 说干就干，大家分工协作，花了两个月时间，就把龙桂鲁教授组里的核磁共振量子计算机放到了云端。大家可以通过下面这个网址了解此项服务的细节：\n <a class=' wrap external' href='https://link.zhihu.com/?target=http%3A//www.nmrcloudq.com/' rel='nofollow noreferrer' target='_blank'>\n  NMRCloudQ\n </a>\n ，相关的论文也已经贴到预印本网站了:\n <a class=' wrap external' href='https://link.zhihu.com/?target=http%3A//arxiv.org/abs/1710.03646' rel='nofollow noreferrer' target='_blank'>\n  A Quantum Cloud Experience on a Nuclear Magnetic Resonance Quantum Computer\n </a>\n 。目前上线的量子云服务只是初步测试版的，只包含四个量子比特，但是逻辑门保真度超过98%，可以完成很多步复杂的逻辑门。之所以把这个服务免费提供给国内外的对量子计算感兴趣的研究者们，是期待能通过大家的反馈来进一步提升系统的能力，大家在量子计算的研究上共同进步，\n <i>\n  <b>\n   一起拨开量子计算的云雾\n  </b>\n </i>\n 。通过这个项目，我们自己也都学到很多东西，期待同行们批评指正，共同进步。\n</p>",
    "updateTime": "2017-10-12 00:00:00"
}