{
    "title": "《歌手》S01E05",
    "userNickname": "邓柯",
    "userDescription": "音乐、流行音乐 话题的优秀回答者",
    "userImageUrl": "https://pic1.zhimg.com/f7b22afb5_is.jpg",
    "answerStar": 586,
    "commentNumber": 109,
    "answerExtraction": " 一、迪玛希《Uptown Funk》 原唱 Bruno Mars，原调 d 小调，音域 C4 - D5，迪玛希沿用原调，音域 F3 - D6 Funk 不同于大多数曲风之处在于：它是个采用「Pattern 式展开」的音乐风格。我们听到的大多数音乐的推进力主要源自和声变化带来的情绪张力（一个段落通常会从稳定的主和弦，慢",
    "answerLength": 6464,
    "globalKeyword": [
        "音乐",
        "音域",
        "原曲",
        "编曲",
        "弗拉门"
    ],
    "answerDescription": "<p>\n <b>\n  一、迪玛希《Uptown Funk》\n </b>\n</p>\n<p>\n 原唱 Bruno Mars，原调 d 小调，音域 C4 - D5，迪玛希沿用原调，音域 F3 - D6\n <br/>\n</p>\n<p>\n Funk 不同于大多数曲风之处在于：它是个采用「Pattern 式展开」的音乐风格。我们听到的大多数音乐的推进力主要源自和声变化带来的情绪张力（一个段落通常会从稳定的主和弦，慢慢向不稳定发展、越来越不稳定，最后解决到稳定，形成闭环，段落结束）。而 Funk 并不通过旋律与和声的发展得到推动，反而是靠不断复制短小的段落循环，通过律动、编曲的变化来实现音乐的发展。从这个角度上看，Funk 和电子乐、嘻哈是非常相似的（并且存在很多交叉）。Funk 会把歌曲和声简化到极致：《Uptown Funk》整首歌只有两个和弦：Dm 和 G，但保证音乐丰满精致的，是密集的节奏吉他扫弦，复杂的织体填充、以及花哨的贝斯旋律线。\n <br/>\n</p>\n<p>\n 相应的，在表演上，Funk 对于节奏的要求就比一般的抒情歌要严格的多。歌手和乐手不仅要卡准节拍，而且在小拍子（小节内弱拍）以及切分点处也要卡准，这样才能保持律动的同步，以及声部之间配合的精准（歌里处处都是 Call &amp; Response 啊）。而这也是迪玛希能力体系里稍弱的一环：迪玛希在这首《Uptown Funk》中基本能够保持乐句级的准确，但间或会出现小拖沓，没有跟上歌曲律动就会影响听感。这个律动精度在他前几首歌里完全不会造成影响（即便是《The Show Must Go On》这类的「快歌」），但在《UF》里就会成为问题（就好比 3mm 的砖缝误差对于 600mm 的墙砖可忽略不计，但对于 30mm 的马赛克就会直接影响观感一样）。\n <br/>\n</p>\n<p>\n 此外，这首歌的编曲也稍显细碎（其实原曲已经编得相当丰满且对比相当强烈了），驾驭这种风格应该沉得住气，多抻几遍然后做个大变化（而不是每反复一遍就加点花）。总体看来是个热闹活泛的表演，放在开场带气氛（但投票上也略微吃亏），发挥有小瑕疵，以后注意就是了。\n <br/>\n</p>\n<br/>\n<br/>\n<p>\n <b>\n  二、赵雷《月亮粑粑》\n </b>\n</p>\n<p>\n 原唱钟志刚，原调 G 大调，音域 D3 - G4，赵雷从 E 大调转到 G 大调，音域 B2 - E4\n <br/>\n</p>\n<p>\n 《月亮粑粑》这首作品，取材自长沙民谣，同时把歌中的意象（月亮），延伸到了歌曲主体当中，变成了成年人关于成长、亲情与乡愁的情感抒发。从创作意图和上讲，和《天黑黑》 有异曲同工之妙。赵雷选择此曲的意图也很明显，除了曲风上的契合之外，歌中的长沙童谣（用的还是长沙方言）也有助于多圈长沙观众的感情票。\n <br/>\n</p>\n<p>\n 从效果上看，首先，《月亮粑粑》此曲本身略显简单，歌曲段内的句法，以及主歌副歌段的句法都过于相似（一二三四五六七~ / 一二三四五六七~ / 一二三~四~一二三四五~ / 一二三四五六七~），很容易产生听觉疲劳。主歌段副歌段都是简短的四句段，缺乏 Pre-Chorus 和桥段的过度，整首歌难以靠乐段形成层次变化，音乐的对比太过依赖于歌词。（这也给赵雷的改编制造了不少难度）\n <br/>\n</p>\n<p>\n 赵雷其实已经在原曲基础上优化了不少，比如把原曲略感僵硬的 3/4 拍，微调成了更细腻的 6/8，和声上也配得更流畅（原曲主歌段中 I7 - IIm 实在有些别扭），但演唱上省略了一些原唱中的装饰音，音色和语气的变化也稍显寡淡。另一个明显的改动就在于歌曲中后段串烧进去的一段《弯弯的月亮》，并且顺势把歌曲从瓷器那的 E 大调升到了 G 。但赵雷的嗓音和刘欢老师那种饱满嘹亮的音色还有距离，而且节奏和配器的变化使得赵雷并没有表达出《弯弯的月亮》中那种充沛的情感，衔接起来有点脱节。\n <br/>\n</p>\n<p>\n 最关键的问题在于赵雷本身发声机能的局限——他这首歌的高音仅仅到 E4，离换声点还有好几度，而如此低的音区就决定了赵雷的演唱和激情、光芒、震撼感……统统无缘。和其他几位堪称「演唱家」的歌手拼演唱，失利是必然的。\n <br/>\n</p>\n<p>\n 其实谈起《月亮粑粑》，我想聊聊另外一段故事。我在北师上学时认识了一个朋友，他是我中学同班同学的大学同班同学的同系校友（拐了七八十道弯），只是因为我们当时都在读非音乐专业（他好像是中山大学经管系的？）但又极度想成为专业音乐人所以未曾谋面时我们就已经感觉非常亲近（我当时在自学编曲，他在自学打鼓）。大三时他来北京跟王澜（谭维维的鼓手）学鼓时我们见过一面。之后我去了音乐学院读书，他在广州成了音乐制作人。虽然他参与了很多歌曲的编曲和制作（其中就有钟志刚这首《月亮粑粑》的录音室版本），但由于产业大环境不好，他还是离开了音乐行业。我们几年后再在北京见面时，他已经回到老家青海成为一名电视台录音师了（路径和我好像）。他有了稳定工作、有了老婆孩子，但他心里还记挂着音乐。他现在还会花时间编曲，会在知乎上回答关于 Logic 的问题，他还会给当地少数民族（藏族、蒙族、回族）的歌手制作带有当地民族特色的流行歌曲——我听过一些，有些写得还有点意思。希望他能够在音乐中得到更多的快乐与享受。\n <br/>\n</p>\n<br/>\n<br/>\n<p>\n <b>\n  三、张杰《默》\n </b>\n</p>\n<p>\n 原唱那英，原曲 f 小调，音域 F3 - bE5，张杰版降 e小调，音域 bE3 - bE5\n <br/>\n</p>\n<p>\n 效果有明显进步。原曲《默》是非常典型的电影营销案例（以很小的成本实现了非常好的宣传效果，另：音乐一直是非常好的话题营销工具，因为便宜）。单独从音乐角度审视也堪称佳作。歌词以及旋律构建出了非常优美的意境，而且整体歌曲在深情之余，又保持了足够的灵动和流畅，没有陷入一味的凄惨悲苦中，分寸感拿捏得很好。\n <br/>\n</p>\n<p>\n 张杰的版本整体上对歌曲进行了强化。编曲上，歌曲前半部分采用了接近于室内乐重奏式的配乐，而后各个声部依次进入。高潮段落的鼓组和吉他都给得很足，音乐的层次对比度要明显高于原曲。除了前半部分的弦乐有时略显碎片化之外，整首歌曲推进得十分流畅。定调上，张杰仅比那英的女声调低了 2key（通常男声唱女歌要降 5 key 以上），这使得张杰演唱时，副歌部分的旋律线频繁超越 C5（high C）。从账面音域上看没有迪玛希高，但从演唱难度和完成度而言，张杰的演唱也是一般人难以企及的。\n <br/>\n</p>\n<p>\n 提升了音域的版本非常有助于张杰展示他嗓音的亮度、力量和稳定，同时，他音色里那种锐利的金属感，反而和加重了的编曲相互映衬，增加了情绪烈度。张杰这次也没有自己胡乱加滑音、颤音或者加什么奇奇怪怪的段落（不必要的装饰音会让演唱和音乐脱节，从而破坏歌曲的整体感），保证了竞演效果。\n <br/>\n</p>\n<br/>\n<br/>\n<p>\n <b>\n  四、林忆莲《克卜勒》\n </b>\n</p>\n<p>\n 原唱孙燕姿，原曲 C 大调，音域 G3 - C5，林忆莲从 #C 大调转到 D 大调，音域 #G3 - #G5\n <br/>\n</p>\n<p>\n 「克卜勒」就是 Kepler，在大陆译为「开普勒」，燕姿歌名里的「克卜勒」指的是德国天文学家开普勒 1604 年发现的一颗超新星，可由人类肉眼观测到，是当时天空中最亮的恒星。两年后的 1606 年，该超新星消失。\n <br/>\n</p>\n<p>\n 有了这个关键信息后，就不难理解孙燕姿歌词中对于星星、银河的描绘，也能理解燕姿在歌中对于无线电噪音的使用。突然闪耀但随后又黯淡隐没的星星，就好比人海中看到某个久别故人、或是未曾谋面但神交已久的朋友，距离虽远但心有微妙灵犀，可环顾四周时又不免感到孤独与陌生，随即怅然起来。\n <br/>\n</p>\n<p>\n Sandy 在此基础上增加了一层更具体的意象：她邀请了一位有语言障碍的小女孩在副歌段落和她一起「表达」，加上演唱之前对改编立意的铺垫，使得整首歌多了一层圣洁与悲悯。与此对应的小细节是，贯穿副歌段的是《阿甘正传》中羽毛主题的变奏，从而把那种漂泊与无常的感觉塑造得更为平和而深刻，也更容易激发出听众的思考与善意。\n <br/>\n</p>\n<p>\n 演唱上，林忆莲仍然保持着足够的柔和与细腻，但也不乏爆发点（给到了 E5 和 #G5），有力地支撑了歌曲的呈现意图。歌曲前段有小失误（「我依然愿意借给」），难道是耳返还不合适？\n <br/>\n</p>\n<br/>\n<br/>\n<p>\n <b>\n  五、狮子合唱团《It’s My Life》\n </b>\n</p>\n<p>\n 原唱 Bon Jovi，原曲 c 小调，G3 - bB4，狮子版  bB2 - D5\n <br/>\n</p>\n<p>\n 《It’s My Life》是 Bon Jovi 的主唱 Jon Bon Jovi、吉他手 Richie Smbora 以及 Max Martin（没错，就是给后街、小甜甜、CA妈、艾薇儿、水果姐、霉霉、A妹、盆栽哥……等人写歌的那位）共同创作的。此曲属于典型的「墙里开花墙外香」，在多国都夺得了榜单冠军，但在美国本土却成绩平平（Billboard Hot 100 榜上最高排到第33）。当然此曲在中国格外火爆的原因是因为一部用了此曲当背景音乐的 CS 的视频的广为流传（由甜咖啡制作）。音乐是非常依赖推广的，除了传统的电影电视综艺，游戏乃至整个 ACG 都成为了捧红音乐的新渠道（比如推红了 Alan Walker 的 LOL），毕竟流量为王用户为王嘛。扯远了。\n <br/>\n</p>\n<p>\n 《It’s My Life》虽然发行于 2000 年，但整体上看还是首相对老派的流行摇滚作品，配器、乐段都相对规整。而狮子本场的版本稍显得花哨了一些：前奏慢速低沉吟诵 + 低八度主歌开场，然后旋律一路上行达到高点 D5，这一大段落作为引子层次已经很丰富了。而后，全乐队进入完成了一段副歌后层次又拉弱进入主歌，到副歌段再加重，中间还加了萧敬腾的钢琴（这种音色和织体略显得软了）。歌曲的前 2/3 一直处在相对凌乱的状态，每经过一个小段落都会伴随着大件乐器的明显变化（失真 riff 消失或是鼓组变散），怒气值攒三泄二，迟迟发不出大招。其实狮子这一版编曲，保留前 1/3 和后 1/3，把中间那 1/3 的花哨招数全去掉，除了常规乐器外只用个 talk box（原版最明显的特征，人声的失真 + 哇音），效果就会明显好转。\n <br/>\n</p>\n<br/>\n<br/>\n<p>\n <b>\n  六、谭晶《赛里木湖的月光》\n </b>\n</p>\n<p>\n e 小调，音域 D4 - A5\n <br/>\n</p>\n<p>\n 参加比赛还专门做首新歌，谭晶老师也是蛮个性的。此曲的作曲及编曲者刘洲老师就是谭维维《给你一点颜色》（春晚版调整成了《华阴老腔一声喊》）的制作人。刘洲老师对于传统音乐与流行歌曲的融汇搭配，是有一番自己的见解的。\n <br/>\n</p>\n<p>\n 这首《赛里木湖的月光》的前半部分取材自维吾尔族民歌《阿瓦尔古丽》（也有翻译成《阿里古丽》的，意思是「最美丽的姑娘」），而后采用了一种典型的维族民歌的段落结构，即「散 - 慢 - 中 - 快」，编曲上也会增加相应的声部，营造出了「神秘 - 吸引 - 活泼轻快 - 热烈奔放」的气氛。配器上，采用了诸多新疆特色民族乐器（弹拨和打击乐器），构建出了律动有力、结构复杂、色彩明亮、对比强烈的织体声部。其他的维吾尔族民歌特征诸如句首弱起、重拍装饰音、微分音吟唱等等，也都出现在了作品当中，这使的整首歌曲呈现出了鲜明的维吾尔族风情。谭晶老师把新疆民歌的演唱特点抓得很到位（部分尾音的上挑、装饰音的区别力度处理、跳进滑音等），又展现了足够的发声技能（副歌频繁的 E5，尾段两句内爬了个 G4 - A5 的大坡），整个演唱也极富感染力。\n <br/>\n</p>\n<p>\n 除此之外，值得一提的在于弗拉门戈（Flamenco）元素的使用。新疆和西班牙远隔万里，但新疆维吾尔族的传统音乐和西班牙的弗拉门戈却有许多相似之处。这个问题我曾当面和克尔曼老师（维吾尔族弗拉门戈吉他演奏家，本场就在台上给谭晶伴奏 &amp; 伴唱）讨论过：热瓦甫、弹布尔等维族传统弹拨乐器的演奏方法和吉他很像，他有新疆弹拨乐器基础所以接触到吉他后很快就上手了。玩指弹自然就会接触到弗拉门戈，而他第一次听到弗拉门戈就感觉这种音乐和维族传统音乐有诸多相似。后来他年长成名游历欧洲时，曾经当面给西班牙的弗拉门戈大师演奏了维吾尔族音乐，对方也很惊讶于，新疆的维吾尔族音乐和弗拉门戈音乐在律动、调式、结构、旋法上存在极多的共同特点——多到让这两种风格常常可以深度融合、无缝切换。如果从历史的角度上看，这些共同点可能源自阿拉伯文化的影响——弗拉门戈兴起于西班牙南部的安达卢西亚地区，因为被摩尔人（分布在南欧和北非的穆斯林）统治长达数百年，使得该地区的传统音乐带有鲜明阿拉伯特征。同时，在我国民族音乐的理论体系中，维吾尔族音乐也是从属于波斯-阿拉伯乐系的——但如何从民族音乐学、音乐人类学的角度概括、论证这二者之间的关系并形成明确的学术结论，还需要相关领域的学者进行深入研究。\n <br/>\n</p>\n<p>\n 还要说明的是，弗拉门戈是包括了演奏、演唱、舞蹈、服装等要素的综合艺术形式。在提速了的高潮段中有维族女舞者上台，同时其他人侧身鼓掌跺脚喝彩（谭晶以及乐手伴唱们），是非常典型地道的弗拉门戈表演。整首歌曲把维吾尔族歌舞与弗拉门戈风情交织在了一起，有歌有舞有视有听，热情奔放之余，又散发着文化的魅力，令人神往。\n <br/>\n</p>\n<p>\n 此处强势插播一条硬广：对「带有浓郁民族风情的流行音乐」感兴趣的同学们，我郑重向大家推荐一档我参与了制作的音乐节目《天籁之声》，节目刚行进至中段，每周四晚 21:10 在东南卫视播出。克尔曼老师和阿来（迪玛希的音乐合伙人）都将在节目中演唱具有浓郁民族特征的歌曲（大家正好也感受一下维吾尔族和哈萨克族音乐的区别呢），还有好多其他民族的歌手（哈雅戴荃腾格尔央吉玛等），具体信息大家自行搜索吧。\n <br/>\n</p>\n<br/>\n<br/>\n<p>\n <b>\n  七、林志炫《你永远不知道》\n </b>\n</p>\n<p>\n bE 大调，音域 D3 - bB4\n <br/>\n</p>\n<p>\n 白驹过隙、一晃五年。\n <br/>\n</p>\n<p>\n 林志炫参加第一季《我是歌手》时就遭到了不少「飙高音」的批评。梳理一下林老师的此间竞演曲目的最高音，《Opera》到了 bA5、《回家》到了 F5、《Easy Lover》到了 bE5、《浮夸》到了 E5 、《Making Love Out of Nothing at All》到了 C5，剩下的《夜夜夜夜》、《烟花易冷》、《没离开过》高音都位于 A4-B4 左右，还有首最高音仅到 E4 的《你的眼神》，并不是每一首都很高。且关键问题在于，林志炫的演绎都非常尊重原曲，演唱中的高音都是原曲里本来就有的（而不是在原版之外自己另加的），所以林志炫老师算是一位难得的「有高音但不飙高音」的歌手。\n <br/>\n</p>\n<p>\n 这五年间《我歌》的音域出现了明显的通货膨胀，高音越来越高音域越来越宽，当然林老师拼起音域来也是不虚的。另一个更明显的问题在于，这几年的编曲越来越精致丰满，某种程度上有些花哨了，而这导致观众们的激动阈值越推越高。第一季《我是歌手》里很多演唱仅仅只能称得上翻唱（这并不代表批评）而非改编，对听众的直观冲击力无法和如今的作品相提并论——本季相对细腻寡淡的杜丽莎放到第一季很可能游刃有余，而当年常常被认为「玩脱了」的尚雯婕放在今年没准就高歌猛进了（可惜没如果啊）。且不论好坏，但观众的口味越来越重是客观事实，如何作出调整来适应更激烈的比赛节奏，则是林志炫老师需要着重考虑的问题。\n <br/>\n</p>\n<p>\n 此外还想聊聊的是林志炫老师近年的 One take。科技的发展逐渐改变了音乐制作方式，从 90 年代开始，数字音乐制作技术的成熟使得音乐行业逐渐转向了非线性制作方式——音乐不再像之前那样同期录制完成，而常常是由不同的乐手依次演唱、演奏，错了可以再改，不满意可以细调，录制完成后经过一系列的剪辑、拼贴、调试、美化后，合成为一个精致的成品。不可否认，这种方式大大地提高了音乐生产的效率（当然也拯救了很多蹩脚的歌手和乐手），所以也迅速成为流行音乐的主流生产方式。可，有效率的东西就一定好么？被淘汰的东西是因为它差么？真实和（音乐生产者们认为的）美感哪个更重要？不真实的美能有多美？什么是真实？\n <br/>\n</p>\n<p>\n 这问题深了。但可以确定的是，相比起主流的唱片制作方式，One take 更真实。\n <br/>\n</p>\n<p>\n 林志炫的 One take 是他对自己内心音乐原则的坚持，是对遭受流水线生产方式冲击的音乐匠心的挽救，从这个意义上看，这和萧敬腾组建狮子合唱团（以及，萧也玩 one take）的用意是相似的。为他俩点赞。\n <br/>\n</p>\n<br/>\n<br/>\n<p>\n <b>\n  八、侧田《命硬》\n </b>\n</p>\n<p>\n 原唱侧田，原调 bE 大调转 E，音域 C3 - B4，现场版从 D 大调转 bE 大调再转 E，音域 B2 - G5\n <br/>\n</p>\n<p>\n 非常工整的一首歌。原版写得就工整，主歌 Pre-Chorus 副歌桥段一应俱全、前奏间奏尾奏分列其中，按部就班升 key、一板一眼推进。现场版也同样精致细腻：早早进鼓，在引子里就先搭好律动架子（复合节拍一直很占便宜所以一定要发挥优势），明显提升了伴唱比例并与歌手频繁互动（甚至专门留了一个阿卡贝拉段落），扩写段落、优化接口、让整个歌曲多升了一次 key，最后还做了一连串精彩的刹车重启。一首抒情歌能编得如此繁而不乱，非常厉害。\n <br/>\n</p>\n<p>\n 正如节目里所说，《命硬》这歌十年前是唱给爱情，如今是唱给自己——咬字凶狠节奏精准从容潇洒偶露狞笑，这就是人到中年历经起落虽然尝遍冷暖识破世情但仍然重新开始不忘初心勇攀高峰的侧田的人生啊。生活积淀出的厚重感，让侧田把这首歌唱得真挚而铿锵。感人。\n <br/>\n</p>\n<br/>\n<br/>\n<p>\n 三票投给：谭晶、张杰、侧田\n</p>",
    "updateTime": "2017-02-20 00:00:00"
}