{
    "title": "《歌手》S01E10",
    "userNickname": "邓柯",
    "userDescription": "音乐、流行音乐 话题的优秀回答者",
    "userImageUrl": "https://pic1.zhimg.com/f7b22afb5_is.jpg",
    "answerStar": 275,
    "commentNumber": 60,
    "answerExtraction": " 一、林志炫《裂心》 原唱王力宏，原曲 C 大调，音域 F3 - C5，林志炫版继承原调，音域 E3 - C5 林志炫老师主动与彭佳慧交换出场位置，高风亮节让人心折。不过即便不交换位置，林老师这一轮的成绩也不会太高，估计也就是个五六名的样子，原因是这轮表演实在是太「反竞技」了。 选歌方面，王力宏的《裂心》是 2015 ",
    "answerLength": 5560,
    "globalKeyword": [
        "歌曲",
        "大调",
        "副歌",
        "调式",
        "段落"
    ],
    "answerDescription": "<p>\n <b>\n  一、林志炫《裂心》\n </b>\n <br/>\n</p>\n<p>\n 原唱王力宏，原曲 C 大调，音域 F3 - C5，林志炫版继承原调，音域 E3 - C5\n <br/>\n</p>\n<p>\n 林志炫老师主动与彭佳慧交换出场位置，高风亮节让人心折。不过即便不交换位置，林老师这一轮的成绩也不会太高，估计也就是个五六名的样子，原因是这轮表演实在是太「反竞技」了。\n <br/>\n</p>\n<p>\n 选歌方面，王力宏的《裂心》是 2015 发行的作品，反响……还 ok 吧。评价不差但也谈不上大热。Rick Price 的《Heaven Knows》则是二十多年前的老歌了（92 年澳大利亚的「年度单曲」），去 QQ 音乐上搜歌，The Pretty Reckless 的《Heaven Knows》排在第一。可见这首歌和当前的国内观众确实存在距离。\n <br/>\n</p>\n<p>\n 演唱方面其实技术要求很高，但不太显难度。《裂心》整体的旋律位置写得都非常高，开嗓第一句就到了 F4（已经是很多口水歌的最高音了），而且一直在这个中高音区晃来晃去。同时，《裂心》和《Heaven Knows》都有高至 C5（High C）的弱唱，跨越换声点，且句法决定了演唱时不能换气。在这种情况下，歌手还要保持声音的纯净、稳定以及高音控制力，是非常难的（非常建议男同学们 K 一遍《裂心》来体会一下整首歌都飘在换声区附近的酸爽感）。\n <br/>\n</p>\n<p>\n 另一个不讨巧的要素来自于风格。两首歌都太过四平八稳了。大调抒情慢板 4/4，用得也都是特别正的和声，色彩的变化对比空间不大。听众们多多品味即便可能会有点儿感觉，但仅仅泛听一遍通常不会有太多感觉，不论对于原版还是林志炫的改编版都是。\n <br/>\n</p>\n<p>\n p.s 两首歌连接时速度上的变化有些突兀。尤其是《裂心》接《Heaven Knows》时，调式配器律动都相同但速度直接慢了 10%，bpm 从83 降到 75 左右，实在有点拖沓感（歌曲加速没事，但减速很影响效果）。写个小接口掩饰一下会比较好。\n <br/>\n</p>\n<p>\n 再 p.s. 这首歌以及后面梁博演唱时用了真三角钢琴（而不是像之前那样在合成器外面套架子），音色舒服，好评。\n <br/>\n</p>\n<br/>\n<br/>\n<p>\n <b>\n  二、林忆莲《柿子》\n </b>\n <br/>\n</p>\n<p>\n 原唱林忆莲，原版 d 小调 / #f 小调，音域 G3 - F5，现场版继承原调原音域\n <br/>\n</p>\n<p>\n 之前在很多场合解释过 Composing 和 Songwriting 的巨大区别（这两个单词在中文里都译为「作曲」）：前者的音乐创作手法、理论、作品规模与形态都更为广阔与复杂，而后者更局限于艺术相对狭小的通俗歌曲范畴（尽管从产业规模上要更庞大）。用个大家都能理解的方式描述，就是合格的 Composer 可以轻松写出合格的流行歌，但合格的 Songwriter 可能完全无法 Compose 出一首室内乐（更遑论交响作品了）。当然，流行音乐是个要非常重视听众感受的行业，很多时候了解听众需求比掌握作曲技巧更重要，所以 Composers 在其中也常常体现不出优势来。但在某些环节，比如需要写出特别有质感的弦乐，或者要给演唱会编管弦版时，就必须找这些受过系统的和声配器训练的 Composer 出马了。\n <br/>\n</p>\n<p>\n 这首《柿子》就是一个特别能体现 Composing 和 Songwriting 的区别和联系的作品，也是一个特别「音乐学院式审美」的作品。假如像节目中所说，这歌创作于二十年前，那么应该就是常石磊在上海音乐附中读作曲（Composing）专业时的作品（是的音乐学院从附小就开始分专业了）。当然，常石磊本人虽然受过系统 Composing 训练，但他的兴趣应该更偏 Songwriting 一些（所以才会去搞流行音乐嘛），于是在本科阶段选择了上音音乐工程系的电子音乐作曲专业，成了安栋的学生、胡彦斌的师哥。\n <br/>\n</p>\n<p>\n 回到作品上。这首《柿子》一方面还保留了类似于流行歌曲的结构，调式也相对稳定（总体位于 d 小调，中间有一个 #f 小调段落），但使用了很多的功能相对开放的和声使调式色彩细腻而模糊。反过来看，即便歌曲可以往流行歌曲那种「主副歌结构」上去套——比如把「柿儿被抢去红嫁妆」这个 d 小调的段落视作主歌，那么 #f 小调的这两句「这是在看天边」就应该视为 Pre-Chorus 段，回到 d 小调的「呜丫」就应该是副歌段（便于表达我们刚才这三段命名为 A B C）。但这又完全不符合主歌铺垫副歌抒情的惯常格式，歌曲的高潮点并没有出现在 C，而是在 B 和第二个 A 段的后半部分形成了情绪的上升（但又不是明显的爆发点），一直到歌曲最后的尾段「有阳光」才真正达到了歌曲情绪的顶点。当然，这只是歌曲复杂之处的表现之一（我也很难在这几百字里把歌曲特征向不太了解作曲的读者们解释清楚）。可以把它理解成站在流行音乐体系边沿的作品，所以它被想突破自己的林忆莲选中了。\n <br/>\n</p>\n<p>\n 所以，把这首作品拿来竞演，根本不用担心内涵不够撑不起演出场面，要考虑的反而是怎样把歌曲信息传达得更具象化，更便于现场听众感知，所以 Sandy 第一次用了伴舞来辅助观众理解作品。音乐上，现场版的编曲避免了录音室版本前半段那种过于空旷的纯钢琴 + 人声的编配，用了埙、笙与扬琴来描绘中国元素（都不是音色突出的乐器，渲染得相对含蓄）。间奏和歌曲后半段的弦乐进行了大幅优化，精致流畅，复杂中又带有细密的质感，这些显示的就都是作曲家们的功力了——参与编曲的王之一与田汨都是上音作曲系毕业的青年作曲家（Composer）呢。\n <br/>\n</p>\n<p>\n 可能大多数歌迷在情感上无法接受，但比起严肃音乐，流行音乐总体上是一个相对保守、简单且范式化的艺术形式。其主要原因是很多听众难以接受艺术形式的过于抽象——所以给大多数人听的歌，音乐不能写得太复杂，还得用文字进行具体化描述（歌词）。但是，从微观上看，有追求的歌手们不会满足于填补社会文化需求，他们有艺术表达与创作的需求；从宏观上看，随着经济及教育水准的提升公众们的艺术审美也会逐渐开放。所以，在 Composing 和 Songwriting 之间的区域会越来越多元、活跃，也会有更多的良好的尝试被吸纳进流行音乐领域中。\n <br/>\n</p>\n<p>\n Sandy 固然要满足观众期待，但也需要在节目中呈现出审美高点。《柿子》的高，来源于表现手法的丰富、细腻，以及抽象所带来的不确定——即便是更具象的文字，也带来无比丰富的解读角度。官方都在说词在讨论环保，可没人仅仅把它理解成环保呢。\n <br/>\n</p>\n<br/>\n<br/>\n<p>\n <b>\n  三、迪玛希《难忘的一天》\n </b>\n <br/>\n</p>\n<p>\n 原唱迪玛希，现场版 f 小调转 g 小调，音域 bE3 - F6\n <br/>\n</p>\n<p>\n 因为是迪玛希自己的创作，所以即便在抒情歌的大框架内放进了大量的炫技段落，但仍然显得相对完整而顺畅。\n <br/>\n</p>\n<p>\n 从歌曲写作上看，十九岁写成这个水准还是值得肯定的，结构并不复杂，大体上基于一个下行主题句进行模进展开。使用了相对保守的抒情曲风，但兼具俄罗斯风情（和声小调，频繁使用属 - 主的连接）和哈萨克元素（重拍装饰音）。\n <br/>\n</p>\n<p>\n 高音仍然锐利。升 key 处那一个长达10秒的 F5 - #F5 - G5 的高音（一个长音没换气）气势如虹，D6 - F6 仍然也有相对松弛的高音。而且这首歌的高音使用得相对克制，炫技与歌曲本身的情绪推进逻辑匹配得比较好（这也说明了「量身定做」对于能力超强的选手的重要性）。同时，通常情况下可以直接升的这个 2key 的台阶，被拆成了半音上行的旋律（同时用作炫技长音），显得更为精细缜密。歌曲后段用了美声化的人声来做华彩段落的打底（而不是惯常的流行化和音），效果很好。\n <br/>\n</p>\n<p>\n 但这首作品的短板也同样明显：它太过流畅、上口（如果不考虑后面的华彩段）、太过符合听众的期待和想象（甚至编曲展开方式都有些套路化），所以忧伤得就没有之前那么高级了。\n <br/>\n</p>\n<br/>\n<br/>\n<p>\n <b>\n  四、李健《红豆曲 + 一生所爱》\n </b>\n <br/>\n</p>\n<p>\n e 小调转 f 小调，音域 D3 - #G4\n <br/>\n</p>\n<p>\n 《红豆曲》是首带有浓郁戏曲元素的作品，而处理这种作品的关键点在于拖腔，也就是在演唱时，某个字的字音已经发完，但仍然在持续发展的旋律。从表现功能上分析，这种大幅延长的旋律是对之前乐句所表达情感的延续，也是演唱者本人的水准和趣味的反映。《红豆曲》这种需要处理得相对细腻的声腔，以及和传统流行歌曲不太一样的长短句形态，对于一般的青年流行歌手而言，可能在艺术上有陌生感，但这对李健而言倒不是大问题——李健在京剧院家属院长大，从小对传统戏曲耳濡目染。而后他又专攻民歌、以特长生身份考入清华，所以对于在流行歌曲里融入传统戏曲元素和民歌发声方法，李健应该是有过思考的。而且从李健之前的表现上看，这个方向的作品还算少的（可能是和他之前的创作方向有距离吧），之后可以多尝试。\n <br/>\n</p>\n<p>\n 《红豆曲》之后串了《一生所爱》，速度略有提升，但调式可以连贯下来。两首歌的旋律位置也大体相同（升 key 前，高潮段的最高音都到了 do，也就是 G4），所以整体上显得比较连贯。歌曲后段也按部就班地增加了编曲层次，在一定范围内制造出了情绪对比和高潮。最后收于 Enya 的《May it be》的哼鸣。编曲思路清晰，歌曲结构发展得也比较有逻辑。\n <br/>\n</p>\n<p>\n 这两首歌的底子，以及歌手音色及演唱方法决定了李健这首作品不可能制造出太大的感官冲击力，只能间接地玩一些含蓄表达，这种拿现实主义的《红楼梦》串浪漫主义的《西游记》再点缀上魔幻主义的《指环王》……就很有文人趣味。整体看来算是有意思的精巧小品吧。\n <br/>\n</p>\n<br/>\n<br/>\n<p>\n <b>\n  五、张杰《自己》\n </b>\n <br/>\n</p>\n<p>\n 原唱许钧，原曲 D 大调，音域 A2 - A4，张杰现场版 D 大调转 E 大调，音域 A2 - B5\n <br/>\n</p>\n<p>\n 又一首来自《中国好歌曲》的优秀作品，许钧凭借此曲得到了索尼中国的青睐，成为了当季节目中唯二获得索尼唱片合约的学员（另一位是苏运莹）。\n <br/>\n</p>\n<p>\n 《自己》这首歌除了情感的真挚以及表达上的坦诚以外，难点在于结构和改编。当然这两点其实是彼此关联的，因为《自己》采用了一个相对特殊的写法：单主副歌循环结构，即前奏之后，连续铺陈了三段主歌（第一第二第三），然后进入副歌，然后再加一个小尾巴之后就结束了。这种非常规结构给了歌曲一点桀骜感，而这对于已经彻底坦然到甚至略带有一点虚无感的歌词文本而言，是一种平衡。\n <br/>\n</p>\n<p>\n 换个角度看，张杰能在这种特殊且各个段落又内嵌得非常紧密的结构中另辟出一个段落，把它改编成规模更大、更适合《歌手》的版本，还是非常难得的。尤其是扩写的「第四」这个段落，从文本和内涵上看，还算和原文连贯统一。编曲反倒不是改编重点，但必要的点缀、氛围和色彩感营造得都不错。舞台表现上……稍微有添足感（倒不是说节目规则，既然允许找伴舞那么用道具应该也是可以的）。这首歌总体内敛自省，并且表达上也相对平白（《柿子》那种神神叨叨的歌确实需要伴舞），所以这种舞台设计其实会在一定程度上分散听众的注意力和已经累计起来的情绪。演唱上张杰一贯的稳，虽然没有许钧声音里的粗糙沧桑感，但胜在咬字生脆，音色清亮。升 key 前后的副歌段的长音完成得都很好。倒是最后那个「超越自己的高音」，比起张杰很锐利的 D5 - F5 音区，音色和音质都有了不少变化，而且加了不少音频处理，并没有达到此前节目里所渲染的那种冲击力。每个人都有自己擅长的音区，没有必要片面追求账面音域。\n <br/>\n</p>\n<br/>\n<br/>\n<p>\n <b>\n  六、狮子合唱团《最后的请求》\n </b>\n <br/>\n</p>\n<p>\n 原唱狮子，原曲 #C 大调 / E 大调转 F 大调，音域 D3 - A4，现场版继承原调原音域\n <br/>\n</p>\n<p>\n 狮子选了一首自己的 pop rock 作品。这首《最后的请求》写作上还是蛮有意思的，主歌副歌分列在 #C 大调和 E 大调两个调上，而且全区最低音 D3 竟然出现在副歌段中。歌曲的旋律推进得四平八稳，更多的层次感来源于段落之间的调式差，以及段落中各种和声的小变化（很多和弦连接得非常新颖精致，这次我就不扒了，留作课后思考题吧）。\n <br/>\n</p>\n<p>\n 编曲方面，中速 4/4 很周正，没有那么多摇滚乐常见的符点切分律动，钢琴演奏着规则的柱式和弦，失真吉他线条拉得很长，鼓也没有太多的零碎节拍，打得很板整，可以俗而精准地概括成「大气」。大气得都不太像一首情歌了，感觉拿来表现励志主题可能会更合适一些。乐队和主唱基本都沿用了录音室的版本，没有进行太多个人发挥。有趣的是，这是《歌手》节目进行到现在，罕见的现场版短于录音室版的竞演——现场版删减了歌曲的器乐尾奏让整曲短了30多秒，前面的段落都保留在了现场版里。\n <br/>\n</p>\n<br/>\n<br/>\n<p>\n <b>\n  七、彭佳慧《想你想疯了》\n </b>\n <br/>\n</p>\n<p>\n 原唱柯以敏，原曲 G 大调，音域 G3 - D5，彭佳慧版从 G 大调转 #G 大调，音域 G3 - F5\n <br/>\n</p>\n<p>\n 效果不佳的表演。\n <br/>\n</p>\n<p>\n 这场表演一个最直接的问题在于对调式的改编而造成的听众调式感混乱：原版从头到尾都是大调，而彭佳慧现场版把很多段落都改成了小调，但一些段落却整体使用了大调（比如间奏后的主歌段）。并且，一些在终止式改成小调的段落，还保留了大量大调式的痕迹，例如原曲副歌段是一个非常典型的大调低音下行的和声连接：I - V/VII - VIm - I/V - IV - I/III - IIm - V（17654325），彭佳慧现场版改成了 IVm - V - IV - I/III - IIm - I/III - IV - V，（65432345）虽然看起来段首第一个和弦（通常是调式主和弦）变成了 VIm 六级，但连续出现两个大调主和弦的转位 I/III，并且段落最后两个和弦 IV - V 几乎就是大调的终止式了——它会给人很强的解决到 I 的倾向，但为了改成小调式，所以它又必须解决到 IVm。这就导致了调式的混乱感，使得每次到了副歌的第一句「我想你想你想你想得快疯了」听起来都会有些别扭。\n <br/>\n</p>\n<p>\n 而之所以要这么强行改调式，是因为原曲留给改编者的发挥空间实在太小：4/4 大调中速抒情口水歌（「想你想你想你想得」真的……太口水了，这么水的词儿竟然还要拿来当 hook 句反复），各种改编方向都堵死了，水词儿也没给串烧留下文本上的对接空间，那么只好铤而走险在调式和和声色彩上做文章了。\n <br/>\n</p>\n<p>\n 之所以选这首《想你想疯了》，除了因为是彭佳慧老师自己的词曲创作外，好像还找不到什么额外的深意。而为了展示自己的词曲创作（且这首水准真的平平）带来一系列改编隐患，绝对得不偿失。所以这首歌效果不佳表面原因是编曲方向错误，深层原因是选曲决策有问题，根本原因是对节目竞技规则理解不透彻。\n <br/>\n</p>\n<p>\n 这五季节目做下来，音乐水准真的是有明显提高。歌手们及其音乐团队都有不断学习，观众们（尤其是大陆的观众们）的口味也在潜移默化中渐渐改变着。时隔五年再杀回节目的彭佳慧老师，需要赶紧了解一下情况，及时调整竞演策略。\n <br/>\n</p>\n<br/>\n<p>\n ————————\n <br/>\n</p>\n<p>\n 三票投给：林忆莲、张杰、迪玛希\n</p>",
    "updateTime": "2017-03-29 00:00:00"
}